const EfrinImage = 'https://res.cloudinary.com/dqe36doqn/image/upload/v1749867757/efrin_ibyoqz.jpg';
const AtarbImage = 'https://res.cloudinary.com/dqe36doqn/image/upload/v1749867757/atarb_yywclb.png';
const AzzazImage = 'https://res.cloudinary.com/dqe36doqn/image/upload/v1749867795/azzaz_cotywg.jpg';
const SamaanImage = 'https://res.cloudinary.com/dqe36doqn/image/upload/v1749867794/samaan_efkids.png';
const BabImage = 'https://res.cloudinary.com/dqe36doqn/image/upload/v1749867762/bab_wcwo71.png';
const DierHaferImage = 'https://res.cloudinary.com/dqe36doqn/image/upload/v1749867810/dirHafer_fkmijr.png';
const SafiraImage = 'https://res.cloudinary.com/dqe36doqn/image/upload/v1749867771/safira_qgdcch.png';
const JarablesImage = 'https://res.cloudinary.com/dqe36doqn/image/upload/v1749867788/jarables_o0ofeu.png';
const MenbagImage = 'https://res.cloudinary.com/dqe36doqn/image/upload/v1749867794/menbag_ip3ggp.png';
const EinArabImage = 'https://res.cloudinary.com/dqe36doqn/image/upload/v1749867766/einArab_uwndix.png';

export const regionsData = [
  {
    region: 'efrin',
    image: EfrinImage,
    title: 'منطقــــة عفريــــن',
    location: 'تقع شمال غرب سوريا',
    population: 'يبلغ عدد السكان /1322713/ نسمة',
    famous: 'زراعة الزيتون وكروم العنب والتين والرمان والتفاح و الاشجار المثمرة و الصناعات الزراعية كما تشتهر بزراعة المحاصيل الشتوية كالقمح و الشعير و الحمص و العدس',
    featured: 'تتمتع بطبيعة جميلة ومناظر خلابة مما جعلها مركزا للسياحة وفيها العديد من المناطق السياحية متل الباسوطة وكفر جنة وشلالات ميدانكي ونهر عفرين',
    managerUnits:{
      cities: [
        'عفرين (مركز المنطقة)',
        'راجو (ناحية)'
      ],
      towns: [
        'شران (ناحية)',
        'شيخ الحديد (ناحية)',
        'المعطيلي (ناحية)',
        'جنديرس (ناحية)',
        'بلبل (ناحية)',
        'برماجة',
        'الميدان',
        'الباسوطة',
        'ابين',
        'الغزاوية',
        'مسكة فوقاني',
        'المدللة',
        'شيخ محمد',
        'معراته عفرين',
        'كفر  صفرة'
      ],
      municipalities: [
        'عقيبة',
        'براد'
      ],
    },
    archaeologicalSites: 'جنديرس  -جلمه - شيخ عبد الرحمن - تل سلور - تل حمو - تل كشور - قطمه عفرين - دير صوان - عين ديبة - معراته - باسوطه - برج عبد الله - كفر نبو - عين دارة - الشوربة - فافرتين',
    regionCenter: 'مدبنة عفرين'
  },
  {
    region: 'azzaz',
    image: AzzazImage,
    title: 'منطقــــة اعــــزاز',
    location: 'تقع في شمال مدينة حلب',
    population: 'يبلغ عدد السكان 562216 نسمة تقريبا',
    famous: 'زراعة الزيتون والكرمة والفستق الحلبي و البطاطا والكرز والتفاحيات والحبوب و الصناعات الغذائية وكما انها تشتهر بزراعة المحاصيل الزراعية وخاصة القمح - الشعير - العدس - الحمص وغيرها من المحاصيل الزراعية الاخرى',
    featured: 'شهدت المنطقة تطورا ملحوظا خلال السنوات الاخيرة من خلال التوسيع في شبكات المياه والهاتف والطرق والكهرباء والمراكز الصحية',
    managerUnits:{
      cities: [
        'اعزاز (مركز المنطقة)',
        'نبل (ناحية)',
        'مارع (ناحية)',
        'تل رفعت (ناحية)'
      ],
      towns: [
        'منغ',
        'اخترين (ناحية)',
        'صوران (ناحية)',
        'كلجبرين',
        'الزهراء',
        'ماير',
        'الباروزة',
        'دابق',
        'دوديان',
        'تلعار غربية',
        'كفرنايا',
        'دير جمال',
        'احتيملات',
        'بيانون',
        'معراته ام حوش',
        'كفرغان',
        'احرص'
      ],
      municipalities: [
        'زيادية فافين حربل'
      ]
    },
    archaeologicalSites: 'اخترين - دابق - زيايدية - تل عار غريبة - ارشاف - تل عار شرقية - قره مزرعة - تل بطال شمالي - تل جيجان - تل شعير - تل رفعت - تلعجار- صوران - دوبق - راعل - القواقلي- الشيخ ريح - البل - فافين - قرامل - مدينة اعزاز - تليل الشام - نبل - كفين',
    regionCenter: 'مدينة اعزاز'
  },
  {
    region: 'atarb',
    image: AtarbImage,
    title: 'منطقــــة الاتــــارب',
    location: 'تقع في الجهة الغربية من محافظة حلب',
    population: 'يبلغ عدد السكان 129284 نسمة',
    famous: 'وتشتهر بزراعة الاشجار المثمرة والزيتون و التين  والعنب وبعض الاصناف الاخرى',
    featured: 'تتميز بمناخ معتدل ويعتمد سكانها على الزراعة, و شهدت المنطقة قفزة نوعية على الصعيدين العمراني والخدمي',
    managerUnits:{
      cities: [
        'الاتارب (مركز المنطقة)',
      ],
      towns: [
        'اورم الكبرى (ناحية)',
        'جبل سمعان (ناحية)',
        'الابزمو'
      ],
      municipalities: ['لا يوجد']
    },
    archaeologicalSites: 'حصن الاتارب',
    regionCenter: 'مدينة الاتارب'
  },
  {
    region: 'samaan',
    image: SamaanImage,
    title: 'منطقــــة جبــــل سمعــــان',
    location: 'تقع منطقة جبل سمعان بمحيط مدينة حلب وتحيط بها من كل الجوانب',
    population: 'يبلغ عدد سكانها 574931 نسمة',
    famous: 'بسبب قرب منطقة جبل سمعان من مدينة حلب ولسهولة المواصلات تشتهر المنطقة بالزراعات الشتوية كالقمح والشعير والعدس والكمون والزراعيات الصيفية والبندورة والخيار والباذنجان وتمتاز ايضا بزراعة الزيتون والعنب وغيرها من  الزراعات الاخرى',
    featured: 'يعتمد سكان المنطقة بشكل كلي على الزراعة وتربية المواشي وتنتشر فيها بعض الصناعات , الادوية , الالبسة والالبان والاجبان... الخ',
    managerUnits:{
      cities: [
        'حلب (مركز المنطقة)',
        'دارة عزة (ناحية)',
        'عندان',
        'تل الضمان (ناحية)',
        'حريتان (ناحية)'
      ],
      towns: [
        'الحاضر (ناحية)',
        'الزربة (ناحية)',
        'عسان',
        'تل شغيب',
        'عنجارة',
        'قبتان الجبل',
        'حيان',
        'زمار (ناحية)',
        'الوضيحي',
        'تربة البويدر',
        'عليص ام الهوتة',
        'برده',
        'تل شعير',
        'تل حدية',
        'شامر',
        'بلاس',
        'العامرية',
        'فاح',
        'خانطومان',
        'تقاد جزرايا'
      ],
      municipalities: [
        'عبطين',
        'العيس',
        'برنة'
      ]
    },
    archaeologicalSites: 'تل دادين - زيتان - الحريشة - برنة - بوابية - تل ممو - تلعلوش - زيارة - تل الضمان - البويدر - عيطة - كفر عبيد - عونات كبيرة - ارجل - ابورويل - عطشانة شرقية - بردة - تل عقارب - قلعة الشيخ - تل الحواحيد - عطشانة غربية - تلصبحة - تل الشور - ابودريخة - تل الضمان - غيطل - جب الابيض - تل الوز - رسم الخرايم - الاندرين - تيارة دارة عزة - قاطورة - دير سمعان - خان نطومان',
    regionCenter: 'مدينة حلب'
  },
  {
    region: 'bab',
    image: BabImage,
    title: 'منطقــــة البــــاب',
    location: 'تقع شمال شرق مدينة حلب',
    population: 'يبلغ عدد سكانها 524207 نسمة',
    famous: 'زراعة اشجار الرمان والعنب والزيتون والحبوب بانواعها والخضروات الصيفية والشتوية كما تشتهر بصناعة الالبان',
    featured: 'شهدت المنطقة نهضة شملت كافة نواحي الحياة خدميا وعمرانيا والتوسع بشبكات المياه والطرق والكهرباء والهاتف, و يعمل معظم السكان في الزراعة وتربية المواشي',
    managerUnits:{
      cities: [
        'الباب (مركز المنطقة)',
        'تادف (ناحية)',
        'بزاعة',
        'العريمة (ناحية)'
      ],
      towns: [
        'قباسين',
        'الراعي (ناحية)',
        'عران',
        'مران',
        'باب الحجر',
        'ابو جبار',
        'حزوان',
        'سوسنباط',
        'عيشة'
      ],
      municipalities: ['سوسيان']
    },
    archaeologicalSites: 'تل احمر-تل الهدى-صفدي-كرسنلي-زيارة الباب-زلف-تل عيشة-تل عطية-شاوة-تل ميزاب-سكرية كبيرة-مصبين-ابو جبار-ام عدسة-تل بيجان-برلهين-تل مكسور-القطر-قباسين-منان-الشجرة -السكرية-تل رحال-الحسانية-صوران الجديدة-تل جرجي -شبيران',
    regionCenter: 'مدينة الباب'
  },
  {
    region: 'dierHafer',
    image: DierHaferImage,
    title: 'منطقــــة ديــــر حافــــر',
    location: 'تقع جنوب  شرقي محافظة حلب على طريق حلب',
    population: 'يبلغ عدد سكانها 83147 نسمة',
    famous: 'الزراعات الصيفية والشتوية و زراعة العنب',
    featured: 'فيها بحيرة الجبول التي تعتبر محمية طبيعية ومكان سياحي, وتحتوي على انواع من الطيور النادرة, و تمتد على مساحة كبيرة ويشرف عليها طريق حلب - خناصر - اثريا, و أغلب اعتماد السكان في المعيشة على تربية المواشي وخصوصا الاغنام',
    managerUnits:{
      cities: ['دير حافر (مركز المنطقة)'],
      towns: [
        'رسم الحرمل (ناحية)',
        'كويرس شرقي(ناحية )',
      ],
      municipalities: ['لا يوجد']
    },
    archaeologicalSites: 'مدينة دير حافر -حميمية كبيرة- تل ايوب - حميمة صغيرة- خساف- زعرايا-الكيارية-تل مكسور- تل سبعين- عين الجماجة -شريح-جديدة عربية-جديدة تل سبعين تل حطابات - ابو صفنة-المفلسة',
    regionCenter: 'مدينة دير حافر'
  },
  {
    region: 'safira',
    image: SafiraImage,
    title: 'منطقــــة السفيــــرة',
    location: 'تقع منطقة السفيرة جنوب شرق مدينة حلب',
    population: 'يبلغ عدد سكانها 346209 نسمة',
    famous: 'تشتهر منطقة السفيرة بالزراعة وتربية المواشي ومن الزراعات الصغيرة المعروفة في المنطقة / البندورة - الباذنجان - الفليلفلة - الخيار - وغيرها من الزراعات الشتوية كالقمح والشعير والعدس/',
    featured: 'يعمل معظم السكان بالزراعة وتربية المواشي وقد شهدت خلال السنوات الاخيرة انجاز العديد من المشاريع الخدمية والعمرانية وتم تحديث وتوسيع شبكات المياه والطرق والكهرباء والهاتف',
    managerUnits:{
      cities: [
        'السفيرة (مركز المنطقة)',
        'تلعرن (ناحية)',
      ],
      towns: [
        'بنان (ناحية)',
        'الحاجب (ناحية)',
        'خناصر (ناحية)',
        'تل حاصل',
        'رسم النفل',
        'ابو جرين',
        'فجدان',
        'عقربة',
        'تل عابور',
      ],
      municipalities: [
        'رسم سيالة',
        'بلاط',
        'رسم الكرع',
        'حمام',
        'قليعة',
        'جعارة',
      ]
    },
    archaeologicalSites: 'خناصر - قرباطة - رسم السيالة - برج سيالة - رسم الكبار - سير البيض - قليعة - رسم عسكر - مدينة السفيرة تل عين - تلعرن - ابوجرين السفيرة  - بلاط - ابودريخة - تل اصطل - تلعلم - طاط - برج الرمان - الفاعوري - عقربوز - باشكوي السفيرة - جلقوم',
    regionCenter: 'مدينة السفيرة'
  },
  {
    region: 'jarables',
    image: JarablesImage,
    title: 'منطقــــة جرابلــــس',
    location: 'تقع شمالا على الحدود السورية التركية عند مدخل نهر الفرات في الاراضي السورية',
    population: 'يبلغ عدد سكانها 120995 نسمة',
    famous: 'تشتهر منطقة جرابلس بزراعة القطن والحبوب والفستق الحلبي والكرمة والزيتون',
    featured: 'يعمل معظم السكان بالزراعة وتربية المواشي و زراعة الزيتون والفستق الحلبي وصناعة الالبان والاجبان ومعاصر الزيتون وقد شهدت المنطقة نهضة في كافة المجالات',
    managerUnits:{
      cities: ['جرابلس (مركز المنطقة)'],
      towns: [
        'الغندورة (ناحية)',
        'الدابس',
        'الجامل',
        'السويدة',
      ],
      municipalities: ['لا يوجد']
    },
    archaeologicalSites: 'حجر الابيض - الفرسان - عرب عزة - غنمة كبيرة - غنمة صغيرة - تل الاعز - العلكدية - تل علي - نبعة كبيرة - الكلية - مرتفع كبير - المدلله جرابلس - جرابلس تحتاني - الجامل - تل شعير -شامية - قدرية - مزعلة - عين البيضا - يوسف بيك - الدابس - تل العمارة',
    regionCenter: 'مدينة جرابلس'
  },
  {
    region: 'menbag',
    image: MenbagImage,
    title: 'منطقــــة منبــــج',
    location: 'تقع شرقي حلب',
    population: 'يبلغ عدد سكانها 603099 نسمة',
    famous: 'الزراعات الحقلية و الزيتون في القسم الشمالي من المنطقة  وتشهتر بزراعة الحبوب و الخضار و الاشجار المثمرة  والصناعات الغذائية و تعتبر مركز للنشاط الاقتصادي في المنطقة وقد شهدت نهضة حيوانية في الفترة الاخيرة ونهضة عمرانية و ثقافية وخدمية و توسيع شبكات المياه و الهاتف و الكهرباء و الطرق',
    featured: 'تعتبر من المدن التاريخية الهامة',
    managerUnits:{
      cities: [
        'منبج (مركز المنطقة)',
        'الخفسة (ناحية)',
        'مسكنة (ناحية)',
      ],
      towns: [
        'ابو قلقل (ناحية)',
        'الفارات',
        'خرفان',
        'حية صغيرة',
        'بابيري فوقاني',
        'تل حوذان',
        'عطشانة',
        'رسم العبد',
        'مسطاحة',
        'عطشانة جب ميري',
        'المعمورة',
        'ابو كخف (ناحية)',
        'مقطع حجر كبير',
        'خربة بشار',
        'اربعة كبير',
        'قرية الروس',
        'حيمر لابدة',
        'خربة تويني',
      ],
      municipalities: [
        'مسعودية',
        'وضحة',
        'قصر المتياها',
        'حطين',
      ]
    },
    archaeologicalSites: 'حديدي - تل اسود - المخزوم -  جب خميس - خان الحمر - تل ماعز - شجرة شاش - حمدان - خربة خال - قشلة يوسف باشا - خربة رمالة - سعن الغزال زونقل - حيمرجيس - حيمر صغير - حيمر كبير - محسنة - صيادة - ام عدس الفارات - منلا اسعد- مطاحة المخزوم - تل توتون',
    regionCenter: 'مدينة منبج'
  },
  {
    region: 'einArab',
    image: EinArabImage,
    title: 'منطقــــة عيــــن العــــرب',
    location: 'تقع شمال شرق حلب ب/150/كم وتبعد /30/كم شرقي الفرات وتقع على الحدود السورية التركية',
    population: 'يبلغ عدد سكانها 335227 نسمة',
    famous: 'تشتهر المنطقة بالزراعة وتربية المواشي ومن اشهر الزراعات الصيفية القمح العدس الشعير الحمص',
    featured: 'يعمل معظم السكان بالزراعة وتربية المواشي, و المدينة مخدمة بشبكات المياه والكهرباء وتطورت بكافة المجالات الخدمية والاجتماعية والاقتصادية',
    managerUnits:{
      cities: ['عين العرب (مركز المنطقة)'],
      towns: [
        'جبرين (ناحية)',
        'شيوخ تحتاني (ناحية)',
        'الفرزدق',
        'عين البط',
        'جعدة المغارة',
        'تل غزال',
        'شيوخ فوقاني',
        'قبة',
        'خشاش كبير',
        'السياحة',
        'ملحة',
        'ماء تحتاني',
        'الجلبية (ناحية)',
      ],
      municipalities: [
        'بئرش',
        'جرائبة',
      ]
    },
    archaeologicalSites: 'الشيوخ الفوقاني - تل احمر - عين العرب - تل عير - ميدان - شيوخ تحتاني - جبرين - رميلة - راس العين شمالي - الية - متين - رمالة - الكرك - قلعة حديد - الطوق (طوقلي) كرك - تل غزال - تل حجر فوقاني - تل حاجب - تل الخحر التحتاني - القصير - روبي - تل شعير - صوص - زرافة - الميدان عين العرب - سيته تحتاني - سيته فوقاني - كيكان',
    regionCenter: 'مدينة عين العرب'
  }
];