const Safira = ({...props}) => {

  const isSelected = props.selectedRegion === 'safira';

  return (
    <div onClick={() => props.setSelectedRegion('safira')} className="group cursor-pointer">
      <svg 
        id="Layer_1" 
        data-name="Layer 1" 
        xmlns="http://www.w3.org/2000/svg" 
        viewBox="0 0 2135.95 2780.24"
        className="absolute w-[28.4%] mt-[31.6%] ml-[25.7%] lg:w-[14.2%] lg:mt-[15.8%] lg:ml-[12.85%]"
      >
        <path 
          d="M642.24,11.95c33.9,40.58,23.26,125.06,36.49,159.15,19.83,51.08,86.65,85.62,106.08,116.02,30.99,48.49,24.81,163.39,56.38,186.94l40.34,10.46c197.98-80.27,381.54,1.95,577.53-9.74,4.33,87.75,9.58,174.94,15.1,262.04.63,9.98,11.89,195.42,16.73,261.45,5.19,70.73,25.3,344.9,89.83,561.99,70.81,238.22,155.26,273.68,303.23,546.72,80.32,148.2,181.76,370.85,252.01,673.26l-372.23-31.33-81.75-144.37-158.07,7.76-1.25,51.75-659.07-33.81c-24.1-15.28-28.08-125.07-53.18-163.63-12.43-19.1-141.09-108.79-149.85-130.45-23.38-57.8,2.84-207.76-31.83-306.57-29.19-83.19-134.53-153.63-150.39-219.77-13.53-56.42,7.17-145.21-19.1-202.96-12.78-28.1-91.24-66.34-98.69-113.1l52.64-72.4-65.09-54.74-11.93-177.16-153.74-109.52c-38.01-85.46,45.22-276.26,49.42-368.43,3.77-82.89-90.35-107.21-122.83-182.77L0,554.19c86.9-86.21,87.55-176.81,139.01-273.24C250.14,72.75,398.59-38.16,642.24,11.95Z"
          className={`transition-colors duration-200 ${isSelected ? 'fill-[#F3EDCD]' : 'fill-black group-hover:fill-[#F3EDCD]'}`} 
        />
        <text
          x="900" 
          y="1200" 
          fontSize="300" 
          className={`transition-colors duration-200 ${isSelected ? 'fill-black' : 'fill-[#F3EDCD] group-hover:fill-black'}`}
          textAnchor="middle"
          fontFamily="Arial, sans-serif"
        >
          السفيرة
        </text>
      </svg>
    </div>
  );
};

export default Safira;
